In [1]:
import pandas as pd

## 예제 3-1  시리즈와 데이터프레임 내의 동일 메소드 확인

In [2]:
op = pd.read_csv('../data/series_dataframe.csv')

In [3]:
op.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [4]:
op.shape

(264, 3)

In [5]:
(op['Series'] == op['DataFrame']).head()

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [6]:
op_eq = op.loc[(op['Series'] == op['DataFrame'])]

In [7]:
op_eq.shape

(190, 3)

In [8]:
op_eq.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [9]:
op_eq.tail()

     Member  Series DataFrame
256  update  update    update
259  values  values    values
260     var     var       var
262   where   where     where
263      xs      xs        xs

In [10]:
op_eq_list = op_eq['Member'].tolist()

In [11]:
import types

In [12]:
count = 0 
for i in op_eq_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
        if count % 7 == 0 :
            print()
    except Exception as e :
        pass

add,  agg,  aggregate,  align,  all,  any,  append,
apply,  combine,  combine_first,  compound,  corr,  count,  cov,
cummax,  cummin,  cumprod,  cumsum,  diff,  div,  divide,
dot,  drop_duplicates,  dropna,  duplicated,  eq,  ewm,  expanding,
fillna,  first_valid_index,  floordiv,  ge,  get_value,  get_values,  gt,
hist,  idxmax,  idxmin,  isin,  isna,  isnull,  keys,
kurt,  kurtosis,  last_valid_index,  le,  lt,  mad,  max,
mean,  median,  memory_usage,  min,  mod,  mode,  mul,
multiply,  ne,  nlargest,  notna,  notnull,  nsmallest,  pow,
prod,  product,  quantile,  radd,  rdiv,  reindex,  reindex_axis,
rename,  reorder_levels,  reset_index,  rfloordiv,  rmod,  rmul,  rolling,
round,  rpow,  rsub,  rtruediv,  sem,  set_value,  shift,
skew,  sort_index,  sort_values,  sortlevel,  std,  sub,  subtract,
sum,  swaplevel,  to_csv,  to_dict,  to_excel,  to_period,  to_sparse,
to_string,  to_timestamp,  transform,  truediv,  unstack,  update,  var,

## 예제 3-2  연산자와 메소드 계산

In [2]:
college = pd.read_csv('../data/2017_college_tuition.csv',encoding='euc-kr')

In [14]:
college.shape

(196, 3)

In [15]:
college.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [16]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [17]:
try :
    college + 5
except Exception as e :
    print(e)

Could not operate 5 with block values must be str, not int

In [18]:
college['평균등록금'] = college['평균등록금'] * 1000

In [19]:
college.head()

         학교명 설립구분    평균등록금
0    강릉원주대학교  국공립  4262000
1      강원대학교  국공립  4116000
2  경남과학기술대학교  국공립  3771000
3      경북대학교  국공립  4351000
4      경상대학교  국공립  3967000

In [20]:
(college['평균등록금'] + college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [21]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [22]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [23]:
help(college['평균등록금'].add)

Help on method add in module pandas.core.ops:

add(other, level=None, fill_value=None, axis=0) method of pandas.core.series.Series instance
    Addition of series and other, element-wise (binary operator `add`).

    Equivalent to ``series + other``, but with support to substitute a fill_value for
    missing data in one of the inputs.

    Parameters
    ----------
    other : Series or scalar value
    fill_value : None or float value, default None (NaN)
        Fill missing (NaN) values with this value. If both Series are
        missing, the result will be missing
    level : int or name
        Broadcast across a level, matching Index values on the
        passed MultiIndex level

    Returns
    -------
    result : Series

    See also
    --------
    Series.radd

## 예제 3-3  특정 자료형을 가지고 열을 구분하기

In [24]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [25]:
college.get_dtype_counts()

int64     1
object    2
dtype: int64

In [26]:
college.select_dtypes(include=['int64']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [27]:
college.select_dtypes(include=['number']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [28]:
college.select_dtypes(include=['object']).head()

         학교명 설립구분
0    강릉원주대학교  국공립
1      강원대학교  국공립
2  경남과학기술대학교  국공립
3      경북대학교  국공립
4      경상대학교  국공립

## 예제 3-4 시리즈 내의 자료값 확인하기

In [29]:
college['평균등록금'].value_counts().head()

3424000    2
7161000    2
6803000    1
7535000    1
6904000    1
Name: 평균등록금, dtype: int64

In [4]:
college['평균등록금'].value_counts(normalize=True).head()

7161    0.010204
3424    0.010204
4351    0.005102
7756    0.005102
2390    0.005102
Name: 평균등록금, dtype: float64

In [30]:
college['설립구분'].value_counts().head()

사립     156
국공립     40
Name: 설립구분, dtype: int64

In [31]:
college['설립구분'].head()

0    국공립
1    국공립
2    국공립
3    국공립
4    국공립
Name: 설립구분, dtype: object

In [32]:
college['설립구분'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: 설립구분, dtype: bool

In [33]:
college['설립구분'].unique()

array(['국공립', '사립'], dtype=object)

## 예제 3-5 내부 구성 값이 크기 비교

In [34]:
college['평균등록금'].nlargest(5)

173    9004000
132    8824000
128    8649000
147    8526000
146    8499000
Name: 평균등록금, dtype: int64

In [35]:
college['평균등록금'].nsmallest(5)

61           0
157    1760000
137    2000000
20     2390000
15     3024000
Name: 평균등록금, dtype: int64

In [36]:
college.nlargest(5,'평균등록금')

           학교명 설립구분    평균등록금
173  한국산업기술대학교   사립  9004000
132      연세대학교   사립  8824000
128      신한대학교   사립  8649000
147    이화여자대학교   사립  8526000
146      을지대학교   사립  8499000

In [37]:
college.nsmallest(5,'평균등록금')

          학교명 설립구분    평균등록금
61   광주가톨릭대학교   사립        0
157   중앙승가대학교   사립  1760000
137   영산선학대학교   사립  2000000
20    서울시립대학교  국공립  2390000
15    부산교육대학교  국공립  3024000

## 예제 3-6 시리즈만 가지는 메소드

In [38]:
op = pd.read_csv('../data/series_dataframe.csv')

In [39]:
op_not = op.loc[(op['Series'] != op['DataFrame'])]

In [40]:
op_not.head()

      Member    Series DataFrame
12  applymap       NaN  applymap
13    argmax    argmax       NaN
14    argmin    argmin       NaN
15   argsort   argsort       NaN
19  asobject  asobject       NaN

In [41]:
op_not.shape

(74, 3)

In [42]:
op_ser = op_not['Series'].dropna()

In [43]:
op_ser_list = op_ser.tolist()

In [44]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

argmax,  argmin,  argsort,  autocorr,  between,
compress,  items,  iteritems,  map,  nonzero,
ptp,  put,  ravel,  repeat,  reshape,
searchsorted,  to_frame,  unique,  valid,  view,

## 예제 3-7 데이터프레임만 가지는 메소드

In [45]:
op_df = op_not['DataFrame'].dropna()

In [46]:
op_df_list = op_df.tolist()

In [47]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.DataFrame.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

items,  iteritems,

In [48]:
import seaborn as sns

In [49]:
iris = sns.load_dataset('iris')

In [50]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [51]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## 예제 3-8 인덱스 변경 및 대체

In [52]:
s = pd.Series([1,2,3,4])

In [53]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [54]:
s_re = s.rename({0:'a',1:'b',2:'c',3:'d'})

In [55]:
s_re

a    1
b    2
c    3
d    4
dtype: int64

In [56]:
s_re.reindex(['a','b','c','e'])

a    1.0
b    2.0
c    3.0
e    NaN
dtype: float64

In [57]:
s_re.reindex(['a','b','c'])

a    1
b    2
c    3
dtype: int64

In [58]:
s_re.reindex(['c','b','a'])

c    3
b    2
a    1
dtype: int64

In [59]:
s1 = pd.Series([10,20,30], index=[0,1,2])

In [60]:
s1

0    10
1    20
2    30
dtype: int64

In [61]:
s1.index.dtype

dtype('int64')

In [62]:
s2 = pd.Series([1,2,3], index=list('012'))

In [63]:
s2

0    1
1    2
2    3
dtype: int64

In [64]:
s2.index.dtype

dtype('O')

In [65]:
s1 + s2

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [66]:
s2.index = [0,1,2]

In [67]:
s1 + s2

0    11
1    22
2    33
dtype: int64

In [68]:
s3 = pd.Series([11,12,13], index=list('012'))

In [69]:
s3 = s3.rename({'0':0, '1':1,'2':2})

In [70]:
s1 + s3

0    21
1    32
2    43
dtype: int64

In [71]:
s4 = pd.Series([11,12,13], index=list('012'))

In [72]:
s4.index.values

array(['0', '1', '2'], dtype=object)

In [73]:
s4.index = s4.index.values.astype('int64')

In [74]:
s1 + s4

0    21
1    32
2    43
dtype: int64